#+TITLE: Basic Testsuite for bnfc-cpp

* Keybindings
  - auto-insert code-block structure
    - <s tab
  - edit code-block
    - C-c '
  - evaluate code-block
    - C-c C-c
  - copy paste:
    - C-SPACE, C-e, M-w, C-y

* compile the project
  #+BEGIN_SRC sh
    cd ../bnfc-cpp; bnfc -m CPP.cf; make  
  #+END_SRC

  #+RESULTS:
  |          |         |            |           |             |           |            |          |   |
  | 69       | rules   | accepted   |           |             |           |            |          |   |
  |          |         |            |           |             |           |            |          |   |
  | Use      | Alex    | 3.0        | to        | compile     | LexCPP.x. |            |          |   |
  | ParCPP.y | Tested  | with       | Happy     | 1.15        |           |            |          |   |
  | no       | change  | to         | file      | AbsCPP.hs   |           |            |          |   |
  | no       | change  | to         | file      | LexCPP.x    |           |            |          |   |
  | no       | change  | to         | file      | ParCPP.y    |           |            |          |   |
  | no       | change  | to         | file      | TestCPP.hs  |           |            |          |   |
  | no       | change  | to         | file      | DocCPP.txt  |           |            |          |   |
  | no       | change  | to         | file      | SkelCPP.hs  |           |            |          |   |
  | no       | change  | to         | file      | PrintCPP.hs |           |            |          |   |
  | no       | change  | to         | file      | ErrM.hs     |           |            |          |   |
  | no       | change  | to         | file      | Makefile    |           |            |          |   |
  | happy    | -gca    | ParCPP.y   |           |             |           |            |          |   |
  | alex     | -g      | LexCPP.x   |           |             |           |            |          |   |
  | ghc      | --make  | TestCPP.hs | -o        | TestCPP     |           |            |          |   |
  | [5       | of      | 7]         | Compiling | LexCPP      | (         | LexCPP.hs, | LexCPP.o | ) |
  | [6       | of      | 7]         | Compiling | ParCPP      | (         | ParCPP.hs, | ParCPP.o | ) |
  | Linking  | TestCPP | ...        |           |             |           |            |          |   |

* testfile 1: hello.cc
  #+BEGIN_SRC sh :results output
    ./../bnfc-cpp/TestCPP hello.cc > foo; cat foo
  #+END_SRC

  #+RESULTS:
  : hello.cc
  : 
  : Parse              Failed...
  : 
  : Tokens:
  : [PT (Pn 44 4 1) (TS "int" 25),PT (Pn 48 4 5) (T_Id "main"),PT (Pn 52 4 9) (TS "(" 3),PT (Pn 53 4 10) (TS ")" 4),PT (Pn 55 5 1) (TS "{" 31),PT (Pn 60 6 9) (T_Id "std"),PT (Pn 63 6 12) (TS ":" 12),PT (Pn 64 6 13) (TS ":" 12),PT (Pn 65 6 14) (T_Id "cout"),PT (Pn 70 6 19) (TS "<" 14),PT (Pn 71 6 20) (TS "<" 14),PT (Pn 73 6 22) (TL "Hello, world!"),PT (Pn 89 6 38) (TS "<" 14),PT (Pn 90 6 39) (TS "<" 14),PT (Pn 92 6 41) (T_Id "std"),PT (Pn 95 6 44) (TS ":" 12),PT (Pn 96 6 45) (TS ":" 12),PT (Pn 97 6 46) (T_Id "endl"),PT (Pn 101 6 50) (TS ";" 13),PT (Pn 104 7 9) (TS "return" 26),PT (Pn 111 7 16) (TI "0"),PT (Pn 112 7 17) (TS ";" 13),PT (Pn 114 8 1) (TS "}" 33)]
  : syntax error at line 6 before : : cout <

* testfile 2: greet.cc
  #+BEGIN_SRC sh :results output
    ./../bnfc-cpp/TestCPP greet.cc > foo; cat foo
  #+END_SRC

  #+RESULTS:
  : greet.cc
  : 
  : Parse              Failed...
  : 
  : Tokens:
  : [PT (Pn 88 5 1) (TS "int" 25),PT (Pn 92 5 5) (T_Id "main"),PT (Pn 96 5 9) (TS "(" 3),PT (Pn 97 5 10) (TS ")" 4),PT (Pn 99 6 1) (TS "{" 31),PT (Pn 132 8 9) (T_Id "std"),PT (Pn 135 8 12) (TS ":" 12),PT (Pn 136 8 13) (TS ":" 12),PT (Pn 137 8 14) (T_Id "cout"),PT (Pn 142 8 19) (TS "<" 14),PT (Pn 143 8 20) (TS "<" 14),PT (Pn 145 8 22) (TL "Please enter your first name: "),PT (Pn 177 8 54) (TS ";" 13),PT (Pn 199 11 9) (T_Id "std"),PT (Pn 202 11 12) (TS ":" 12),PT (Pn 203 11 13) (TS ":" 12),PT (Pn 204 11 14) (TS "string" 27),PT (Pn 211 11 21) (T_Id "name"),PT (Pn 215 11 25) (TS ";" 13),PT (Pn 239 12 9) (T_Id "std"),PT (Pn 242 12 12) (TS ":" 12),PT (Pn 243 12 13) (TS ":" 12),PT (Pn 244 12 14) (T_Id "cin"),PT (Pn 248 12 18) (TS ">" 18),PT (Pn 249 12 19) (TS ">" 18),PT (Pn 251 12 21) (T_Id "name"),PT (Pn 255 12 25) (TS ";" 13),PT (Pn 304 15 9) (T_Id "std"),PT (Pn 307 15 12) (TS ":" 12),PT (Pn 308 15 13) (TS ":" 12),PT (Pn 309 15 14) (T_Id "cout"),PT (Pn 314 15 19) (TS "<" 14),PT (Pn 315 15 20) (TS "<" 14),PT (Pn 317 15 22) (TL "Hello, "),PT (Pn 327 15 32) (TS "<" 14),PT (Pn 328 15 33) (TS "<" 14),PT (Pn 330 15 35) (T_Id "name"),PT (Pn 336 15 41) (TS "<" 14),PT (Pn 337 15 42) (TS "<" 14),PT (Pn 339 15 44) (TL "!"),PT (Pn 343 15 48) (TS "<" 14),PT (Pn 344 15 49) (TS "<" 14),PT (Pn 346 15 51) (T_Id "std"),PT (Pn 349 15 54) (TS ":" 12),PT (Pn 350 15 55) (TS ":" 12),PT (Pn 351 15 56) (T_Id "endl"),PT (Pn 355 15 60) (TS ";" 13),PT (Pn 358 16 9) (TS "return" 26),PT (Pn 365 16 16) (TI "0"),PT (Pn 366 16 17) (TS ";" 13),PT (Pn 368 17 1) (TS "}" 33)]
  : syntax error at line 8 before : : cout <

* testfile 3: med.cc
  #+BEGIN_SRC sh :results output
    ./../bnfc-cpp/TestCPP med.cc > foo; cat foo
  #+END_SRC

  #+RESULTS:
  : med.cc
  : 
  : Parse              Failed...
  : 
  : Tokens:
  : [PT (Pn 136 10 1) (T_Id "using"),PT (Pn 142 10 7) (T_Id "std"),PT (Pn 145 10 10) (TS ":" 12),PT (Pn 146 10 11) (TS ":" 12),PT (Pn 147 10 12) (T_Id "cin"),PT (Pn 150 10 15) (TS ";" 13),PT (Pn 164 10 29) (T_Id "using"),PT (Pn 170 10 35) (T_Id "std"),PT (Pn 173 10 38) (TS ":" 12),PT (Pn 174 10 39) (TS ":" 12),PT (Pn 175 10 40) (T_Id "sort"),PT (Pn 179 10 44) (TS ";" 13),PT (Pn 181 11 1) (T_Id "using"),PT (Pn 187 11 7) (T_Id "std"),PT (Pn 190 11 10) (TS ":" 12),PT (Pn 191 11 11) (TS ":" 12),PT (Pn 192 11 12) (T_Id "cout"),PT (Pn 196 11 16) (TS ";" 13),PT (Pn 209 11 29) (T_Id "using"),PT (Pn 215 11 35) (T_Id "std"),PT (Pn 218 11 38) (TS ":" 12),PT (Pn 219 11 39) (TS ":" 12),PT (Pn 220 11 40) (T_Id "streamsize"),PT (Pn 230 11 50) (TS ";" 13),PT (Pn 232 12 1) (T_Id "using"),PT (Pn 238 12 7) (T_Id "std"),PT (Pn 241 12 10) (TS ":" 12),PT (Pn 242 12 11) (TS ":" 12),PT (Pn 243 12 12) (T_Id "endl"),PT (Pn 247 12 16) (TS ";" 13),PT (Pn 260 12 29) (T_Id "using"),PT (Pn 266 12 35) (T_Id "std"),PT (Pn 269 12 38) (TS ":" 12),PT (Pn 270 12 39) (TS ":" 12),PT (Pn 271 12 40) (TS "string" 27),PT (Pn 277 12 46) (TS ";" 13),PT (Pn 279 13 1) (T_Id "using"),PT (Pn 285 13 7) (T_Id "std"),PT (Pn 288 13 10) (TS ":" 12),PT (Pn 289 13 11) (TS ":" 12),PT (Pn 290 13 12) (T_Id "setprecision"),PT (Pn 302 13 24) (TS ";" 13),PT (Pn 307 13 29) (T_Id "using"),PT (Pn 313 13 35) (T_Id "std"),PT (Pn 316 13 38) (TS ":" 12),PT (Pn 317 13 39) (TS ":" 12),PT (Pn 318 13 40) (T_Id "vector"),PT (Pn 324 13 46) (TS ";" 13),PT (Pn 327 15 1) (TS "int" 25),PT (Pn 331 15 5) (T_Id "main"),PT (Pn 335 15 9) (TS "(" 3),PT (Pn 336 15 10) (TS ")" 4),PT (Pn 338 16 1) (TS "{" 31),PT (Pn 381 18 9) (T_Id "cout"),PT (Pn 386 18 14) (TS "<" 14),PT (Pn 387 18 15) (TS "<" 14),PT (Pn 389 18 17) (TL "Please enter your first name: "),PT (Pn 421 18 49) (TS ";" 13),PT (Pn 424 19 9) (TS "string" 27),PT (Pn 431 19 16) (T_Id "name"),PT (Pn 435 19 20) (TS ";" 13),PT (Pn 438 20 9) (T_Id "cin"),PT (Pn 442 20 13) (TS ">" 18),PT (Pn 443 20 14) (TS ">" 18),PT (Pn 445 20 16) (T_Id "name"),PT (Pn 449 20 20) (TS ";" 13),PT (Pn 452 21 9) (T_Id "cout"),PT (Pn 457 21 14) (TS "<" 14),PT (Pn 458 21 15) (TS "<" 14),PT (Pn 460 21 17) (TL "Hello, "),PT (Pn 470 21 27) (TS "<" 14),PT (Pn 471 21 28) (TS "<" 14),PT (Pn 473 21 30) (T_Id "name"),PT (Pn 478 21 35) (TS "<" 14),PT (Pn 479 21 36) (TS "<" 14),PT (Pn 481 21 38) (TL "!"),PT (Pn 485 21 42) (TS "<" 14),PT (Pn 486 21 43) (TS "<" 14),PT (Pn 488 21 45) (T_Id "endl"),PT (Pn 492 21 49) (TS ";" 13),PT (Pn 546 24 9) (T_Id "cout"),PT (Pn 551 24 14) (TS "<" 14),PT (Pn 552 24 15) (TS "<" 14),PT (Pn 554 24 17) (TL "Please enter your midterm and final exam grades: "),PT (Pn 605 24 68) (TS ";" 13),PT (Pn 608 25 9) (TS "double" 21),PT (Pn 615 25 16) (T_Id "midterm"),PT (Pn 622 25 23) (TS "," 8),PT (Pn 624 25 25) (T_Id "final"),PT (Pn 629 25 30) (TS ";" 13),PT (Pn 632 26 9) (T_Id "cin"),PT (Pn 636 26 13) (TS ">" 18),PT (Pn 637 26 14) (TS ">" 18),PT (Pn 639 26 16) (T_Id "midterm"),PT (Pn 647 26 24) (TS ">" 18),PT (Pn 648 26 25) (TS ">" 18),PT (Pn 650 26 27) (T_Id "final"),PT (Pn 655 26 32) (TS ";" 13),PT (Pn 700 29 9) (T_Id "cout"),PT (Pn 705 29 14) (TS "<" 14),PT (Pn 706 29 15) (TS "<" 14),PT (Pn 708 29 17) (TL "Enter all your homework grades, "),PT (Pn 752 30 17) (TL "followed by end-of-file: "),PT (Pn 779 30 44) (TS ";" 13),PT (Pn 783 32 9) (T_Id "vector"),PT (Pn 789 32 15) (TS "<" 14),PT (Pn 790 32 16) (TS "double" 21),PT (Pn 796 32 22) (TS ">" 18),PT (Pn 798 32 24) (T_Id "homework"),PT (Pn 806 32 32) (TS ";" 13),PT (Pn 809 33 9) (TS "double" 21),PT (Pn 816 33 16) (T_Id "x"),PT (Pn 817 33 17) (TS ";" 13),PT (Pn 891 35 9) (TS "while" 30),PT (Pn 897 35 15) (TS "(" 3),PT (Pn 898 35 16) (T_Id "cin"),PT (Pn 902 35 20) (TS ">" 18),PT (Pn 903 35 21) (TS ">" 18),PT (Pn 905 35 23) (T_Id "x"),PT (Pn 906 35 24) (TS ")" 4),PT (Pn 910 36 17) (T_Id "homework"),Err (Pn 918 36 25)]
  : syntax error at line 10 before using std : :

* testfile 4: grade.cc
  #+BEGIN_SRC sh :results output
    ./../bnfc-cpp/TestCPP grade.cc > foo; cat foo
  #+END_SRC

  #+RESULTS:
  : grade.cc
  : 
  : Parse              Failed...
  : 
  : Tokens:
  : [PT (Pn 105 7 1) (T_Id "using"),PT (Pn 111 7 7) (T_Id "std"),PT (Pn 114 7 10) (TS ":" 12),PT (Pn 115 7 11) (TS ":" 12),PT (Pn 116 7 12) (T_Id "domain_error"),PT (Pn 128 7 24) (TS ";" 13),PT (Pn 131 7 27) (T_Id "using"),PT (Pn 137 7 33) (T_Id "std"),PT (Pn 140 7 36) (TS ":" 12),PT (Pn 141 7 37) (TS ":" 12),PT (Pn 142 7 38) (T_Id "vector"),PT (Pn 148 7 44) (TS ";" 13),PT (Pn 243 11 1) (TS "double" 21),PT (Pn 250 11 8) (T_Id "grade"),PT (Pn 255 11 13) (TS "(" 3),PT (Pn 256 11 14) (TS "double" 21),PT (Pn 263 11 21) (T_Id "midterm"),PT (Pn 270 11 28) (TS "," 8),PT (Pn 272 11 30) (TS "double" 21),PT (Pn 279 11 37) (T_Id "final"),PT (Pn 284 11 42) (TS "," 8),PT (Pn 286 11 44) (TS "double" 21),PT (Pn 293 11 51) (T_Id "homework"),PT (Pn 301 11 59) (TS ")" 4),PT (Pn 303 12 1) (TS "{" 31),PT (Pn 306 13 9) (TS "return" 26),PT (Pn 313 13 16) (TD "0.2"),PT (Pn 317 13 20) (TS "*" 5),PT (Pn 319 13 22) (T_Id "midterm"),PT (Pn 327 13 30) (TS "+" 6),PT (Pn 329 13 32) (TD "0.4"),PT (Pn 333 13 36) (TS "*" 5),PT (Pn 335 13 38) (T_Id "final"),PT (Pn 341 13 44) (TS "+" 6),PT (Pn 343 13 46) (TD "0.4"),PT (Pn 347 13 50) (TS "*" 5),PT (Pn 349 13 52) (T_Id "homework"),PT (Pn 357 13 60) (TS ";" 13),PT (Pn 359 14 1) (TS "}" 33),PT (Pn 546 19 1) (TS "double" 21),PT (Pn 553 19 8) (T_Id "grade"),PT (Pn 558 19 13) (TS "(" 3),PT (Pn 559 19 14) (TS "double" 21),PT (Pn 566 19 21) (T_Id "midterm"),PT (Pn 573 19 28) (TS "," 8),PT (Pn 575 19 30) (TS "double" 21),PT (Pn 582 19 37) (T_Id "final"),PT (Pn 587 19 42) (TS "," 8),PT (Pn 589 19 44) (T_Id "const"),PT (Pn 595 19 50) (T_Id "vector"),PT (Pn 601 19 56) (TS "<" 14),PT (Pn 602 19 57) (TS "double" 21),PT (Pn 608 19 63) (TS ">" 18),Err (Pn 610 19 65)]
  : syntax error at line 7 before using std : :

* testfile 5: palin.cc
  #+BEGIN_SRC sh :results output
    ./../bnfc-cpp/TestCPP palin.cc > foo; cat foo
  #+END_SRC

  #+RESULTS:
  : palin.cc
  : 
  : Parse              Failed...
  : 
  : Tokens:
  : [PT (Pn 78 6 1) (T_Id "using"),PT (Pn 84 6 7) (T_Id "std"),PT (Pn 87 6 10) (TS ":" 12),PT (Pn 88 6 11) (TS ":" 12),PT (Pn 89 6 12) (T_Id "cin"),PT (Pn 92 6 15) (TS ";" 13),PT (Pn 106 6 29) (T_Id "using"),PT (Pn 112 6 35) (T_Id "std"),PT (Pn 115 6 38) (TS ":" 12),PT (Pn 116 6 39) (TS ":" 12),PT (Pn 117 6 40) (T_Id "cout"),PT (Pn 121 6 44) (TS ";" 13),PT (Pn 123 7 1) (T_Id "using"),PT (Pn 129 7 7) (T_Id "std"),PT (Pn 132 7 10) (TS ":" 12),PT (Pn 133 7 11) (TS ":" 12),PT (Pn 134 7 12) (T_Id "endl"),PT (Pn 138 7 16) (TS ";" 13),PT (Pn 151 7 29) (T_Id "using"),PT (Pn 157 7 35) (T_Id "std"),PT (Pn 160 7 38) (TS ":" 12),PT (Pn 161 7 39) (TS ":" 12),PT (Pn 162 7 40) (T_Id "equal"),PT (Pn 167 7 45) (TS ";" 13),PT (Pn 169 8 1) (T_Id "using"),PT (Pn 175 8 7) (T_Id "std"),PT (Pn 178 8 10) (TS ":" 12),PT (Pn 179 8 11) (TS ":" 12),PT (Pn 180 8 12) (TS "string" 27),PT (Pn 186 8 18) (TS ";" 13),PT (Pn 197 8 29) (T_Id "using"),PT (Pn 203 8 35) (T_Id "std"),PT (Pn 206 8 38) (TS ":" 12),PT (Pn 207 8 39) (TS ":" 12),PT (Pn 208 8 40) (T_Id "transform"),PT (Pn 217 8 49) (TS ";" 13),PT (Pn 237 11 1) (T_Id "using"),PT (Pn 243 11 7) (T_Id "std"),PT (Pn 246 11 10) (TS ":" 12),PT (Pn 247 11 11) (TS ":" 12),PT (Pn 248 11 12) (T_Id "isspace"),PT (Pn 255 11 19) (TS ";" 13),PT (Pn 265 14 1) (TS "bool" 20),PT (Pn 270 14 6) (T_Id "is_palindrome"),PT (Pn 283 14 19) (TS "(" 3),PT (Pn 284 14 20) (T_Id "const"),PT (Pn 290 14 26) (TS "string" 27),Err (Pn 297 14 33)]
  : syntax error at line 6 before using std : :

* testfile 6: grammar.cc
  #+BEGIN_SRC sh :results output
    ./../bnfc-cpp/TestCPP grammar.cc > foo; cat foo
  #+END_SRC

  #+RESULTS:
  : grammar.cc
  : 
  : Parse              Failed...
  : 
  : Tokens:
  : [PT (Pn 300 16 1) (T_Id "using"),PT (Pn 306 16 7) (T_Id "std"),PT (Pn 309 16 10) (TS ":" 12),PT (Pn 310 16 11) (TS ":" 12),PT (Pn 311 16 12) (T_Id "istream"),PT (Pn 318 16 19) (TS ";" 13),PT (Pn 330 16 31) (T_Id "using"),PT (Pn 336 16 37) (T_Id "std"),PT (Pn 339 16 40) (TS ":" 12),PT (Pn 340 16 41) (TS ":" 12),PT (Pn 341 16 42) (T_Id "cin"),PT (Pn 344 16 45) (TS ";" 13),PT (Pn 346 17 1) (T_Id "using"),PT (Pn 352 17 7) (T_Id "std"),PT (Pn 355 17 10) (TS ":" 12),PT (Pn 356 17 11) (TS ":" 12),PT (Pn 357 17 12) (T_Id "copy"),PT (Pn 361 17 16) (TS ";" 13),PT (Pn 376 17 31) (T_Id "using"),PT (Pn 382 17 37) (T_Id "std"),PT (Pn 385 17 40) (TS ":" 12),PT (Pn 386 17 41) (TS ":" 12),PT (Pn 387 17 42) (T_Id "cout"),PT (Pn 391 17 46) (TS ";" 13),PT (Pn 393 18 1) (T_Id "using"),PT (Pn 399 18 7) (T_Id "std"),PT (Pn 402 18 10) (TS ":" 12),PT (Pn 403 18 11) (TS ":" 12),PT (Pn 404 18 12) (T_Id "endl"),PT (Pn 408 18 16) (TS ";" 13),PT (Pn 423 18 31) (T_Id "using"),PT (Pn 429 18 37) (T_Id "std"),PT (Pn 432 18 40) (TS ":" 12),PT (Pn 433 18 41) (TS ":" 12),PT (Pn 434 18 42) (T_Id "find"),PT (Pn 438 18 46) (TS ";" 13),PT (Pn 440 19 1) (T_Id "using"),PT (Pn 446 19 7) (T_Id "std"),PT (Pn 449 19 10) (TS ":" 12),PT (Pn 450 19 11) (TS ":" 12),PT (Pn 451 19 12) (T_Id "getline"),PT (Pn 458 19 19) (TS ";" 13),PT (Pn 470 19 31) (T_Id "using"),PT (Pn 476 19 37) (T_Id "std"),PT (Pn 479 19 40) (TS ":" 12),PT (Pn 480 19 41) (TS ":" 12),PT (Pn 481 19 42) (T_Id "logic_error"),PT (Pn 492 19 53) (TS ";" 13),PT (Pn 494 20 1) (T_Id "using"),PT (Pn 500 20 7) (T_Id "std"),PT (Pn 503 20 10) (TS ":" 12),PT (Pn 504 20 11) (TS ":" 12),PT (Pn 505 20 12) (T_Id "map"),PT (Pn 508 20 15) (TS ";" 13),PT (Pn 524 20 31) (T_Id "using"),PT (Pn 530 20 37) (T_Id "std"),PT (Pn 533 20 40) (TS ":" 12),PT (Pn 534 20 41) (TS ":" 12),PT (Pn 535 20 42) (TS "string" 27),PT (Pn 541 20 48) (TS ";" 13),PT (Pn 543 21 1) (T_Id "using"),PT (Pn 549 21 7) (T_Id "std"),PT (Pn 552 21 10) (TS ":" 12),PT (Pn 553 21 11) (TS ":" 12),PT (Pn 554 21 12) (T_Id "vector"),PT (Pn 560 21 18) (TS ";" 13),PT (Pn 573 21 31) (T_Id "using"),PT (Pn 579 21 37) (T_Id "std"),PT (Pn 582 21 40) (TS ":" 12),PT (Pn 583 21 41) (TS ":" 12),PT (Pn 584 21 42) (T_Id "domain_error"),PT (Pn 596 21 54) (TS ";" 13),PT (Pn 598 22 1) (T_Id "using"),PT (Pn 604 22 7) (T_Id "std"),PT (Pn 607 22 10) (TS ":" 12),PT (Pn 608 22 11) (TS ":" 12),PT (Pn 609 22 12) (T_Id "rand"),PT (Pn 613 22 16) (TS ";" 13),PT (Pn 616 24 1) (T_Id "typedef"),PT (Pn 624 24 9) (T_Id "vector"),PT (Pn 630 24 15) (TS "<" 14),PT (Pn 631 24 16) (TS "string" 27),PT (Pn 637 24 22) (TS ">" 18),PT (Pn 639 24 24) (T_Id "Rule"),PT (Pn 643 24 28) (TS ";" 13),PT (Pn 645 25 1) (T_Id "typedef"),PT (Pn 653 25 9) (T_Id "vector"),PT (Pn 659 25 15) (TS "<" 14),PT (Pn 660 25 16) (T_Id "Rule"),PT (Pn 664 25 20) (TS ">" 18),PT (Pn 666 25 22) (T_Id "Rule_collection"),PT (Pn 681 25 37) (TS ";" 13),PT (Pn 683 26 1) (T_Id "typedef"),PT (Pn 691 26 9) (T_Id "map"),PT (Pn 694 26 12) (TS "<" 14),PT (Pn 695 26 13) (TS "string" 27),PT (Pn 701 26 19) (TS "," 8),PT (Pn 703 26 21) (T_Id "Rule_collection"),PT (Pn 718 26 36) (TS ">" 18),PT (Pn 720 26 38) (T_Id "Grammar"),PT (Pn 727 26 45) (TS ";" 13),PT (Pn 774 29 1) (T_Id "Grammar"),PT (Pn 782 29 9) (T_Id "read_grammar"),PT (Pn 794 29 21) (TS "(" 3),PT (Pn 795 29 22) (T_Id "istream"),Err (Pn 803 29 30)]
  : syntax error at line 16 before using std : :

